garyPenhook/PIC-Assembler/device_includes/pic18f25q24.inc
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
U2RXPPS                                  equ 0274h
// bitfield definitions
U2RXPPS_PIN_POSN                         equ 0000h
U2RXPPS_PIN_POSITION                     equ 0000h
U2RXPPS_PIN_SIZE                         equ 0003h
U2RXPPS_PIN_LENGTH                       equ 0003h
U2RXPPS_PIN_MASK                         equ 0007h
U2RXPPS_PORT_POSN                        equ 0003h
U2RXPPS_PORT_POSITION                    equ 0003h
U2RXPPS_PORT_SIZE                        equ 0003h
U2RXPPS_PORT_LENGTH                      equ 0003h
U2RXPPS_PORT_MASK                        equ 0038h
U2RXPPS_U2RXPPS0_POSN                    equ 0000h
U2RXPPS_U2RXPPS0_POSITION                equ 0000h
U2RXPPS_U2RXPPS0_SIZE                    equ 0001h
U2RXPPS_U2RXPPS0_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS0_MASK                    equ 0001h
U2RXPPS_U2RXPPS1_POSN                    equ 0001h
U2RXPPS_U2RXPPS1_POSITION                equ 0001h
U2RXPPS_U2RXPPS1_SIZE                    equ 0001h
U2RXPPS_U2RXPPS1_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS1_MASK                    equ 0002h
U2RXPPS_U2RXPPS2_POSN                    equ 0002h
U2RXPPS_U2RXPPS2_POSITION                equ 0002h
U2RXPPS_U2RXPPS2_SIZE                    equ 0001h
U2RXPPS_U2RXPPS2_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS2_MASK                    equ 0004h
U2RXPPS_U2RXPPS3_POSN                    equ 0003h
U2RXPPS_U2RXPPS3_POSITION                equ 0003h
U2RXPPS_U2RXPPS3_SIZE                    equ 0001h
U2RXPPS_U2RXPPS3_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS3_MASK                    equ 0008h
U2RXPPS_U2RXPPS4_POSN                    equ 0004h
U2RXPPS_U2RXPPS4_POSITION                equ 0004h
U2RXPPS_U2RXPPS4_SIZE                    equ 0001h
U2RXPPS_U2RXPPS4_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS4_MASK                    equ 0010h
U2RXPPS_U2RXPPS5_POSN                    equ 0005h
U2RXPPS_U2RXPPS5_POSITION                equ 0005h
U2RXPPS_U2RXPPS5_SIZE                    equ 0001h
U2RXPPS_U2RXPPS5_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS5_MASK                    equ 0020h
U2RXPPS_U2RXPPS_POSN                     equ 0000h
U2RXPPS_U2RXPPS_POSITION                 equ 0000h
U2RXPPS_U2RXPPS_SIZE                     equ 0006h
U2RXPPS_U2RXPPS_LENGTH                   equ 0006h
U2RXPPS_U2RXPPS_MASK                     equ 003Fh

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
U2CTSPPS                                 equ 0275h
// bitfield definitions
U2CTSPPS_PIN_POSN                        equ 0000h
U2CTSPPS_PIN_POSITION                    equ 0000h
U2CTSPPS_PIN_SIZE                        equ 0003h
U2CTSPPS_PIN_LENGTH                      equ 0003h
U2CTSPPS_PIN_MASK                        equ 0007h
U2CTSPPS_PORT_POSN                       equ 0003h
U2CTSPPS_PORT_POSITION                   equ 0003h
U2CTSPPS_PORT_SIZE                       equ 0003h
U2CTSPPS_PORT_LENGTH                     equ 0003h
U2CTSPPS_PORT_MASK                       equ 0038h
U2CTSPPS_U2CTSPPS0_POSN                  equ 0000h
U2CTSPPS_U2CTSPPS0_POSITION              equ 0000h
U2CTSPPS_U2CTSPPS0_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS0_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS0_MASK                  equ 0001h
U2CTSPPS_U2CTSPPS1_POSN                  equ 0001h
U2CTSPPS_U2CTSPPS1_POSITION              equ 0001h
U2CTSPPS_U2CTSPPS1_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS1_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS1_MASK                  equ 0002h
U2CTSPPS_U2CTSPPS2_POSN                  equ 0002h
U2CTSPPS_U2CTSPPS2_POSITION              equ 0002h
U2CTSPPS_U2CTSPPS2_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS2_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS2_MASK                  equ 0004h
U2CTSPPS_U2CTSPPS3_POSN                  equ 0003h
U2CTSPPS_U2CTSPPS3_POSITION              equ 0003h
U2CTSPPS_U2CTSPPS3_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS3_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS3_MASK                  equ 0008h
U2CTSPPS_U2CTSPPS4_POSN                  equ 0004h
U2CTSPPS_U2CTSPPS4_POSITION              equ 0004h
U2CTSPPS_U2CTSPPS4_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS4_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS4_MASK                  equ 0010h
U2CTSPPS_U2CTSPPS5_POSN                  equ 0005h
U2CTSPPS_U2CTSPPS5_POSITION              equ 0005h
U2CTSPPS_U2CTSPPS5_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS5_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS5_MASK                  equ 0020h
U2CTSPPS_U2CTSPPS_POSN                   equ 0000h
U2CTSPPS_U2CTSPPS_POSITION               equ 0000h
U2CTSPPS_U2CTSPPS_SIZE                   equ 0006h
U2CTSPPS_U2CTSPPS_LENGTH                 equ 0006h
U2CTSPPS_U2CTSPPS_MASK                   equ 003Fh

// Register: TUIN0PPS
#define TUIN0PPS TUIN0PPS
TUIN0PPS                                 equ 0278h
// bitfield definitions
TUIN0PPS_PIN_POSN                        equ 0000h
TUIN0PPS_PIN_POSITION                    equ 0000h
TUIN0PPS_PIN_SIZE                        equ 0003h
TUIN0PPS_PIN_LENGTH                      equ 0003h
TUIN0PPS_PIN_MASK                        equ 0007h
TUIN0PPS_PORT_POSN                       equ 0003h
TUIN0PPS_PORT_POSITION                   equ 0003h
TUIN0PPS_PORT_SIZE                       equ 0003h
TUIN0PPS_PORT_LENGTH                     equ 0003h
TUIN0PPS_PORT_MASK                       equ 0038h
TUIN0PPS_TUIN0PPS_POSN                   equ 0000h
TUIN0PPS_TUIN0PPS_POSITION               equ 0000h
TUIN0PPS_TUIN0PPS_SIZE                   equ 0006h
TUIN0PPS_TUIN0PPS_LENGTH                 equ 0006h
TUIN0PPS_TUIN0PPS_MASK                   equ 003Fh
TUIN0PPS_TUIN0PPS0_POSN                  equ 0000h
TUIN0PPS_TUIN0PPS0_POSITION              equ 0000h
TUIN0PPS_TUIN0PPS0_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS0_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS0_MASK                  equ 0001h
TUIN0PPS_TUIN0PPS1_POSN                  equ 0001h
TUIN0PPS_TUIN0PPS1_POSITION              equ 0001h
TUIN0PPS_TUIN0PPS1_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS1_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS1_MASK                  equ 0002h
TUIN0PPS_TUIN0PPS2_POSN                  equ 0002h
TUIN0PPS_TUIN0PPS2_POSITION              equ 0002h
TUIN0PPS_TUIN0PPS2_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS2_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS2_MASK                  equ 0004h
TUIN0PPS_TUIN0PPS3_POSN                  equ 0003h
TUIN0PPS_TUIN0PPS3_POSITION              equ 0003h
TUIN0PPS_TUIN0PPS3_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS3_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS3_MASK                  equ 0008h
TUIN0PPS_TUIN0PPS4_POSN                  equ 0004h
TUIN0PPS_TUIN0PPS4_POSITION              equ 0004h
TUIN0PPS_TUIN0PPS4_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS4_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS4_MASK                  equ 0010h
TUIN0PPS_TUIN0PPS5_POSN                  equ 0005h
TUIN0PPS_TUIN0PPS5_POSITION              equ 0005h
TUIN0PPS_TUIN0PPS5_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS5_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS5_MASK                  equ 0020h

// Register: TUIN1PPS
#define TUIN1PPS TUIN1PPS
TUIN1PPS                                 equ 0279h
// bitfield definitions
TUIN1PPS_PIN_POSN                        equ 0000h
TUIN1PPS_PIN_POSITION                    equ 0000h
TUIN1PPS_PIN_SIZE                        equ 0003h
TUIN1PPS_PIN_LENGTH                      equ 0003h
TUIN1PPS_PIN_MASK                        equ 0007h
TUIN1PPS_PORT_POSN                       equ 0003h
TUIN1PPS_PORT_POSITION                   equ 0003h
TUIN1PPS_PORT_SIZE                       equ 0003h
TUIN1PPS_PORT_LENGTH                     equ 0003h
TUIN1PPS_PORT_MASK                       equ 0038h
TUIN1PPS_TUIN1PPS_POSN                   equ 0000h
TUIN1PPS_TUIN1PPS_POSITION               equ 0000h
TUIN1PPS_TUIN1PPS_SIZE                   equ 0006h
TUIN1PPS_TUIN1PPS_LENGTH                 equ 0006h
TUIN1PPS_TUIN1PPS_MASK                   equ 003Fh
TUIN1PPS_TUIN1PPS0_POSN                  equ 0000h
TUIN1PPS_TUIN1PPS0_POSITION              equ 0000h
TUIN1PPS_TUIN1PPS0_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS0_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS0_MASK                  equ 0001h
TUIN1PPS_TUIN1PPS1_POSN                  equ 0001h
TUIN1PPS_TUIN1PPS1_POSITION              equ 0001h
TUIN1PPS_TUIN1PPS1_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS1_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS1_MASK                  equ 0002h
TUIN1PPS_TUIN1PPS2_POSN                  equ 0002h
TUIN1PPS_TUIN1PPS2_POSITION              equ 0002h
TUIN1PPS_TUIN1PPS2_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS2_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS2_MASK                  equ 0004h
TUIN1PPS_TUIN1PPS3_POSN                  equ 0003h
TUIN1PPS_TUIN1PPS3_POSITION              equ 0003h
TUIN1PPS_TUIN1PPS3_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS3_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS3_MASK                  equ 0008h
TUIN1PPS_TUIN1PPS4_POSN                  equ 0004h
TUIN1PPS_TUIN1PPS4_POSITION              equ 0004h
TUIN1PPS_TUIN1PPS4_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS4_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS4_MASK                  equ 0010h
TUIN1PPS_TUIN1PPS5_POSN                  equ 0005h
TUIN1PPS_TUIN1PPS5_POSITION              equ 0005h
TUIN1PPS_TUIN1PPS5_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS5_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS5_MASK                  equ 0020h

// Register: PORTWIN0PPS
#define PORTWIN0PPS PORTWIN0PPS
PORTWIN0PPS                              equ 027Dh
// bitfield definitions
PORTWIN0PPS_PIN_POSN                     equ 0000h
PORTWIN0PPS_PIN_POSITION                 equ 0000h
PORTWIN0PPS_PIN_SIZE                     equ 0003h
PORTWIN0PPS_PIN_LENGTH                   equ 0003h
PORTWIN0PPS_PIN_MASK                     equ 0007h
PORTWIN0PPS_PORT_POSN                    equ 0003h
PORTWIN0PPS_PORT_POSITION                equ 0003h
PORTWIN0PPS_PORT_SIZE                    equ 0003h
PORTWIN0PPS_PORT_LENGTH                  equ 0003h
PORTWIN0PPS_PORT_MASK                    equ 0038h
PORTWIN0PPS_PORTWIN0PPS_POSN             equ 0000h
PORTWIN0PPS_PORTWIN0PPS_POSITION         equ 0000h
PORTWIN0PPS_PORTWIN0PPS_SIZE             equ 0006h
PORTWIN0PPS_PORTWIN0PPS_LENGTH           equ 0006h
PORTWIN0PPS_PORTWIN0PPS_MASK             equ 003Fh
PORTWIN0PPS_PORTWIN0PPS0_POSN            equ 0000h
PORTWIN0PPS_PORTWIN0PPS0_POSITION        equ 0000h
PORTWIN0PPS_PORTWIN0PPS0_SIZE            equ 0001h
PORTWIN0PPS_PORTWIN0PPS0_LENGTH          equ 0001h
PORTWIN0PPS_PORTWIN0PPS0_MASK            equ 0001h
PORTWIN0PPS_PORTWIN0PPS1_POSN            equ 0001h
PORTWIN0PPS_PORTWIN0PPS1_POSITION        equ 0001h
PORTWIN0PPS_PORTWIN0PPS1_SIZE            equ 0001h
PORTWIN0PPS_PORTWIN0PPS1_LENGTH          equ 0001h
PORTWIN0PPS_PORTWIN0PPS1_MASK            equ 0002h
PORTWIN0PPS_PORTWIN0PPS2_POSN            equ 0002h
PORTWIN0PPS_PORTWIN0PPS2_POSITION        equ 0002h
PORTWIN0PPS_PORTWIN0PPS2_SIZE            equ 0001h
PORTWIN0PPS_PORTWIN0PPS2_LENGTH          equ 0001h
PORTWIN0PPS_PORTWIN0PPS2_MASK            equ 0004h
PORTWIN0PPS_PORTWIN0PPS3_POSN            equ 0003h
PORTWIN0PPS_PORTWIN0PPS3_POSITION        equ 0003h
PORTWIN0PPS_PORTWIN0PPS3_SIZE            equ 0001h
PORTWIN0PPS_PORTWIN0PPS3_LENGTH          equ 0001h
PORTWIN0PPS_PORTWIN0PPS3_MASK            equ 0008h
PORTWIN0PPS_PORTWIN0PPS4_POSN            equ 0004h
PORTWIN0PPS_PORTWIN0PPS4_POSITION        equ 0004h
PORTWIN0PPS_PORTWIN0PPS4_SIZE            equ 0001h
PORTWIN0PPS_PORTWIN0PPS4_LENGTH          equ 0001h
PORTWIN0PPS_PORTWIN0PPS4_MASK            equ 0010h
PORTWIN0PPS_PORTWIN0PPS5_POSN            equ 0005h
PORTWIN0PPS_PORTWIN0PPS5_POSITION        equ 0005h
PORTWIN0PPS_PORTWIN0PPS5_SIZE            equ 0001h
PORTWIN0PPS_PORTWIN0PPS5_LENGTH          equ 0001h
PORTWIN0PPS_PORTWIN0PPS5_MASK            equ 0020h

// Register: PORTWIN1PPS
#define PORTWIN1PPS PORTWIN1PPS
PORTWIN1PPS                              equ 027Eh
// bitfield definitions
PORTWIN1PPS_PIN_POSN                     equ 0000h
PORTWIN1PPS_PIN_POSITION                 equ 0000h
PORTWIN1PPS_PIN_SIZE                     equ 0003h
PORTWIN1PPS_PIN_LENGTH                   equ 0003h
PORTWIN1PPS_PIN_MASK                     equ 0007h
PORTWIN1PPS_PORT_POSN                    equ 0003h
PORTWIN1PPS_PORT_POSITION                equ 0003h
PORTWIN1PPS_PORT_SIZE                    equ 0003h
PORTWIN1PPS_PORT_LENGTH                  equ 0003h
PORTWIN1PPS_PORT_MASK                    equ 0038h
PORTWIN1PPS_PORTWIN1PPS_POSN             equ 0000h
PORTWIN1PPS_PORTWIN1PPS_POSITION         equ 0000h
PORTWIN1PPS_PORTWIN1PPS_SIZE             equ 0006h
PORTWIN1PPS_PORTWIN1PPS_LENGTH           equ 0006h
PORTWIN1PPS_PORTWIN1PPS_MASK             equ 003Fh
PORTWIN1PPS_PORTWIN1PPS0_POSN            equ 0000h
PORTWIN1PPS_PORTWIN1PPS0_POSITION        equ 0000h
PORTWIN1PPS_PORTWIN1PPS0_SIZE            equ 0001h
PORTWIN1PPS_PORTWIN1PPS0_LENGTH          equ 0001h
PORTWIN1PPS_PORTWIN1PPS0_MASK            equ 0001h
PORTWIN1PPS_PORTWIN1PPS1_POSN            equ 0001h
PORTWIN1PPS_PORTWIN1PPS1_POSITION        equ 0001h
PORTWIN1PPS_PORTWIN1PPS1_SIZE            equ 0001h
PORTWIN1PPS_PORTWIN1PPS1_LENGTH          equ 0001h
PORTWIN1PPS_PORTWIN1PPS1_MASK            equ 0002h
PORTWIN1PPS_PORTWIN1PPS2_POSN            equ 0002h
PORTWIN1PPS_PORTWIN1PPS2_POSITION        equ 0002h
PORTWIN1PPS_PORTWIN1PPS2_SIZE            equ 0001h
PORTWIN1PPS_PORTWIN1PPS2_LENGTH          equ 0001h
PORTWIN1PPS_PORTWIN1PPS2_MASK            equ 0004h
PORTWIN1PPS_PORTWIN1PPS3_POSN            equ 0003h
PORTWIN1PPS_PORTWIN1PPS3_POSITION        equ 0003h
PORTWIN1PPS_PORTWIN1PPS3_SIZE            equ 0001h
PORTWIN1PPS_PORTWIN1PPS3_LENGTH          equ 0001h
PORTWIN1PPS_PORTWIN1PPS3_MASK            equ 0008h
PORTWIN1PPS_PORTWIN1PPS4_POSN            equ 0004h
PORTWIN1PPS_PORTWIN1PPS4_POSITION        equ 0004h
PORTWIN1PPS_PORTWIN1PPS4_SIZE            equ 0001h
PORTWIN1PPS_PORTWIN1PPS4_LENGTH          equ 0001h
PORTWIN1PPS_PORTWIN1PPS4_MASK            equ 0010h
PORTWIN1PPS_PORTWIN1PPS5_POSN            equ 0005h
PORTWIN1PPS_PORTWIN1PPS5_POSITION        equ 0005h
PORTWIN1PPS_PORTWIN1PPS5_SIZE            equ 0001h
PORTWIN1PPS_PORTWIN1PPS5_LENGTH          equ 0001h
PORTWIN1PPS_PORTWIN1PPS5_MASK            equ 0020h

