garyPenhook/PIC-Assembler/device_includes/pic18f25q24.inc
// Register: I2C2BAUD
#define I2C2BAUD I2C2BAUD
I2C2BAUD                                 equ 02B3h
// bitfield definitions
I2C2BAUD_BAUD_POSN                       equ 0000h
I2C2BAUD_BAUD_POSITION                   equ 0000h
I2C2BAUD_BAUD_SIZE                       equ 0008h
I2C2BAUD_BAUD_LENGTH                     equ 0008h
I2C2BAUD_BAUD_MASK                       equ 00FFh

// Register: I2C2CLK
#define I2C2CLK I2C2CLK
I2C2CLK                                  equ 02B4h
// bitfield definitions
I2C2CLK_CLK_POSN                         equ 0000h
I2C2CLK_CLK_POSITION                     equ 0000h
I2C2CLK_CLK_SIZE                         equ 0008h
I2C2CLK_CLK_LENGTH                       equ 0008h
I2C2CLK_CLK_MASK                         equ 00FFh
I2C2CLK_I2CCLK_POSN                      equ 0000h
I2C2CLK_I2CCLK_POSITION                  equ 0000h
I2C2CLK_I2CCLK_SIZE                      equ 0008h
I2C2CLK_I2CCLK_LENGTH                    equ 0008h
I2C2CLK_I2CCLK_MASK                      equ 00FFh
I2C2CLK_CLK0_POSN                        equ 0000h
I2C2CLK_CLK0_POSITION                    equ 0000h
I2C2CLK_CLK0_SIZE                        equ 0001h
I2C2CLK_CLK0_LENGTH                      equ 0001h
I2C2CLK_CLK0_MASK                        equ 0001h
I2C2CLK_CLK1_POSN                        equ 0001h
I2C2CLK_CLK1_POSITION                    equ 0001h
I2C2CLK_CLK1_SIZE                        equ 0001h
I2C2CLK_CLK1_LENGTH                      equ 0001h
I2C2CLK_CLK1_MASK                        equ 0002h
I2C2CLK_CLK2_POSN                        equ 0002h
I2C2CLK_CLK2_POSITION                    equ 0002h
I2C2CLK_CLK2_SIZE                        equ 0001h
I2C2CLK_CLK2_LENGTH                      equ 0001h
I2C2CLK_CLK2_MASK                        equ 0004h
I2C2CLK_CLK3_POSN                        equ 0003h
I2C2CLK_CLK3_POSITION                    equ 0003h
I2C2CLK_CLK3_SIZE                        equ 0001h
I2C2CLK_CLK3_LENGTH                      equ 0001h
I2C2CLK_CLK3_MASK                        equ 0008h
I2C2CLK_CLK4_POSN                        equ 0004h
I2C2CLK_CLK4_POSITION                    equ 0004h
I2C2CLK_CLK4_SIZE                        equ 0001h
I2C2CLK_CLK4_LENGTH                      equ 0001h
I2C2CLK_CLK4_MASK                        equ 0010h
I2C2CLK_I2CCLK0_POSN                     equ 0000h
I2C2CLK_I2CCLK0_POSITION                 equ 0000h
I2C2CLK_I2CCLK0_SIZE                     equ 0001h
I2C2CLK_I2CCLK0_LENGTH                   equ 0001h
I2C2CLK_I2CCLK0_MASK                     equ 0001h
I2C2CLK_I2CCLK1_POSN                     equ 0001h
I2C2CLK_I2CCLK1_POSITION                 equ 0001h
I2C2CLK_I2CCLK1_SIZE                     equ 0001h
I2C2CLK_I2CCLK1_LENGTH                   equ 0001h
I2C2CLK_I2CCLK1_MASK                     equ 0002h
I2C2CLK_I2CCLK2_POSN                     equ 0002h
I2C2CLK_I2CCLK2_POSITION                 equ 0002h
I2C2CLK_I2CCLK2_SIZE                     equ 0001h
I2C2CLK_I2CCLK2_LENGTH                   equ 0001h
I2C2CLK_I2CCLK2_MASK                     equ 0004h
I2C2CLK_I2CCLK3_POSN                     equ 0003h
I2C2CLK_I2CCLK3_POSITION                 equ 0003h
I2C2CLK_I2CCLK3_SIZE                     equ 0001h
I2C2CLK_I2CCLK3_LENGTH                   equ 0001h
I2C2CLK_I2CCLK3_MASK                     equ 0008h
I2C2CLK_I2CCLK4_POSN                     equ 0004h
I2C2CLK_I2CCLK4_POSITION                 equ 0004h
I2C2CLK_I2CCLK4_SIZE                     equ 0001h
I2C2CLK_I2CCLK4_LENGTH                   equ 0001h
I2C2CLK_I2CCLK4_MASK                     equ 0010h

// Register: I2C2BTOC
#define I2C2BTOC I2C2BTOC
I2C2BTOC                                 equ 02B5h
// bitfield definitions
I2C2BTOC_BTOC_POSN                       equ 0000h
I2C2BTOC_BTOC_POSITION                   equ 0000h
I2C2BTOC_BTOC_SIZE                       equ 0008h
I2C2BTOC_BTOC_LENGTH                     equ 0008h
I2C2BTOC_BTOC_MASK                       equ 00FFh
I2C2BTOC_I2CBTOC_POSN                    equ 0000h
I2C2BTOC_I2CBTOC_POSITION                equ 0000h
I2C2BTOC_I2CBTOC_SIZE                    equ 0008h
I2C2BTOC_I2CBTOC_LENGTH                  equ 0008h
I2C2BTOC_I2CBTOC_MASK                    equ 00FFh
I2C2BTOC_BTOC0_POSN                      equ 0000h
I2C2BTOC_BTOC0_POSITION                  equ 0000h
I2C2BTOC_BTOC0_SIZE                      equ 0001h
I2C2BTOC_BTOC0_LENGTH                    equ 0001h
I2C2BTOC_BTOC0_MASK                      equ 0001h
I2C2BTOC_BTOC1_POSN                      equ 0001h
I2C2BTOC_BTOC1_POSITION                  equ 0001h
I2C2BTOC_BTOC1_SIZE                      equ 0001h
I2C2BTOC_BTOC1_LENGTH                    equ 0001h
I2C2BTOC_BTOC1_MASK                      equ 0002h
I2C2BTOC_BTOC2_POSN                      equ 0002h
I2C2BTOC_BTOC2_POSITION                  equ 0002h
I2C2BTOC_BTOC2_SIZE                      equ 0001h
I2C2BTOC_BTOC2_LENGTH                    equ 0001h
I2C2BTOC_BTOC2_MASK                      equ 0004h
I2C2BTOC_BTOC3_POSN                      equ 0003h
I2C2BTOC_BTOC3_POSITION                  equ 0003h
I2C2BTOC_BTOC3_SIZE                      equ 0001h
I2C2BTOC_BTOC3_LENGTH                    equ 0001h
I2C2BTOC_BTOC3_MASK                      equ 0008h
I2C2BTOC_I2CBTOC0_POSN                   equ 0000h
I2C2BTOC_I2CBTOC0_POSITION               equ 0000h
I2C2BTOC_I2CBTOC0_SIZE                   equ 0001h
I2C2BTOC_I2CBTOC0_LENGTH                 equ 0001h
I2C2BTOC_I2CBTOC0_MASK                   equ 0001h
I2C2BTOC_I2CBTOC1_POSN                   equ 0001h
I2C2BTOC_I2CBTOC1_POSITION               equ 0001h
I2C2BTOC_I2CBTOC1_SIZE                   equ 0001h
I2C2BTOC_I2CBTOC1_LENGTH                 equ 0001h
I2C2BTOC_I2CBTOC1_MASK                   equ 0002h
I2C2BTOC_I2CBTOC2_POSN                   equ 0002h
I2C2BTOC_I2CBTOC2_POSITION               equ 0002h
I2C2BTOC_I2CBTOC2_SIZE                   equ 0001h
I2C2BTOC_I2CBTOC2_LENGTH                 equ 0001h
I2C2BTOC_I2CBTOC2_MASK                   equ 0004h
I2C2BTOC_I2CBTOC3_POSN                   equ 0003h
I2C2BTOC_I2CBTOC3_POSITION               equ 0003h
I2C2BTOC_I2CBTOC3_SIZE                   equ 0001h
I2C2BTOC_I2CBTOC3_LENGTH                 equ 0001h
I2C2BTOC_I2CBTOC3_MASK                   equ 0008h

// Register: U1RXB
#define U1RXB U1RXB
U1RXB                                    equ 02B6h
// bitfield definitions
U1RXB_RXB_POSN                           equ 0000h
U1RXB_RXB_POSITION                       equ 0000h
U1RXB_RXB_SIZE                           equ 0008h
U1RXB_RXB_LENGTH                         equ 0008h
U1RXB_RXB_MASK                           equ 00FFh

