garyPenhook/PIC-Assembler/device_includes/pic18f25q24.inc
#define SPI1CLKSEL4                      BANKMASK(SPI1CLK), 4, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE3), 2, a
#define SPI1IF                           BANKMASK(PIR3), 2, a
#define SPI1IP                           BANKMASK(IPR3), 2, a
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD3), 4, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE3), 0, a
#define SPI1RXIF                         BANKMASK(PIR3), 0, a
#define SPI1RXIP                         BANKMASK(IPR3), 0, a
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SCKPPS0                      BANKMASK(SPI1SCKPPS), 0, b
#define SPI1SCKPPS1                      BANKMASK(SPI1SCKPPS), 1, b
#define SPI1SCKPPS2                      BANKMASK(SPI1SCKPPS), 2, b
#define SPI1SCKPPS3                      BANKMASK(SPI1SCKPPS), 3, b
#define SPI1SCKPPS4                      BANKMASK(SPI1SCKPPS), 4, b
#define SPI1SCKPPS5                      BANKMASK(SPI1SCKPPS), 5, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDIPPS0                      BANKMASK(SPI1SDIPPS), 0, b
#define SPI1SDIPPS1                      BANKMASK(SPI1SDIPPS), 1, b
#define SPI1SDIPPS2                      BANKMASK(SPI1SDIPPS), 2, b
#define SPI1SDIPPS3                      BANKMASK(SPI1SDIPPS), 3, b
#define SPI1SDIPPS4                      BANKMASK(SPI1SDIPPS), 4, b
#define SPI1SDIPPS5                      BANKMASK(SPI1SDIPPS), 5, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1SSPPS0                       BANKMASK(SPI1SSPPS), 0, b
#define SPI1SSPPS1                       BANKMASK(SPI1SSPPS), 1, b
#define SPI1SSPPS2                       BANKMASK(SPI1SSPPS), 2, b
#define SPI1SSPPS3                       BANKMASK(SPI1SSPPS), 3, b
#define SPI1SSPPS4                       BANKMASK(SPI1SSPPS), 4, b
#define SPI1SSPPS5                       BANKMASK(SPI1SSPPS), 5, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE3), 1, a
#define SPI1TXIF                         BANKMASK(PIR3), 1, a
#define SPI1TXIP                         BANKMASK(IPR3), 1, a
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPI2BMODE                        BANKMASK(SPI2CON0), 0, b
#define SPI2BUSY                         BANKMASK(SPI2CON2), 7, b
#define SPI2CKE                          BANKMASK(SPI2CON1), 6, b
#define SPI2CKP                          BANKMASK(SPI2CON1), 5, b
#define SPI2CLKSEL0                      BANKMASK(SPI2CLK), 0, b
#define SPI2CLKSEL1                      BANKMASK(SPI2CLK), 1, b
#define SPI2CLKSEL2                      BANKMASK(SPI2CLK), 2, b
#define SPI2CLKSEL3                      BANKMASK(SPI2CLK), 3, b
#define SPI2CLKSEL4                      BANKMASK(SPI2CLK), 4, b
#define SPI2CLRBF                        BANKMASK(SPI2STATUS), 2, b
#define SPI2EOSIE                        BANKMASK(SPI2INTE), 4, b
#define SPI2EOSIF                        BANKMASK(SPI2INTF), 4, b
#define SPI2FST                          BANKMASK(SPI2CON1), 4, b
#define SPI2IE                           BANKMASK(PIE11), 2, a
#define SPI2IF                           BANKMASK(PIR11), 2, a
#define SPI2IP                           BANKMASK(IPR11), 2, a
#define SPI2LSBF                         BANKMASK(SPI2CON0), 2, b
#define SPI2MD                           BANKMASK(PMD3), 5, b
#define SPI2MST                          BANKMASK(SPI2CON0), 1, b
#define SPI2RXBF                         BANKMASK(SPI2STATUS), 0, b
#define SPI2RXIE                         BANKMASK(PIE11), 0, a
#define SPI2RXIF                         BANKMASK(PIR11), 0, a
#define SPI2RXIP                         BANKMASK(IPR11), 0, a
#define SPI2RXOIE                        BANKMASK(SPI2INTE), 2, b
#define SPI2RXOIF                        BANKMASK(SPI2INTF), 2, b
#define SPI2RXR                          BANKMASK(SPI2CON2), 0, b
#define SPI2RXRE                         BANKMASK(SPI2STATUS), 3, b
#define SPI2SCKPPS0                      BANKMASK(SPI2SCKPPS), 0, b
#define SPI2SCKPPS1                      BANKMASK(SPI2SCKPPS), 1, b
#define SPI2SCKPPS2                      BANKMASK(SPI2SCKPPS), 2, b
#define SPI2SCKPPS3                      BANKMASK(SPI2SCKPPS), 3, b
#define SPI2SCKPPS4                      BANKMASK(SPI2SCKPPS), 4, b
#define SPI2SCKPPS5                      BANKMASK(SPI2SCKPPS), 5, b
#define SPI2SDIP                         BANKMASK(SPI2CON1), 1, b
#define SPI2SDIPPS0                      BANKMASK(SPI2SDIPPS), 0, b
#define SPI2SDIPPS1                      BANKMASK(SPI2SDIPPS), 1, b
#define SPI2SDIPPS2                      BANKMASK(SPI2SDIPPS), 2, b
#define SPI2SDIPPS3                      BANKMASK(SPI2SDIPPS), 3, b
#define SPI2SDIPPS4                      BANKMASK(SPI2SDIPPS), 4, b
#define SPI2SDIPPS5                      BANKMASK(SPI2SDIPPS), 5, b
#define SPI2SDOP                         BANKMASK(SPI2CON1), 0, b
#define SPI2SMP                          BANKMASK(SPI2CON1), 7, b
#define SPI2SOSIE                        BANKMASK(SPI2INTE), 5, b
#define SPI2SOSIF                        BANKMASK(SPI2INTF), 5, b
#define SPI2SPIEN                        BANKMASK(SPI2CON0), 7, b
#define SPI2SRMTIE                       BANKMASK(SPI2INTE), 7, b
#define SPI2SRMTIF                       BANKMASK(SPI2INTF), 7, b
#define SPI2SSET                         BANKMASK(SPI2CON2), 2, b
#define SPI2SSFLT                        BANKMASK(SPI2CON2), 6, b
#define SPI2SSP                          BANKMASK(SPI2CON1), 2, b
#define SPI2SSPPS0                       BANKMASK(SPI2SSPPS), 0, b
#define SPI2SSPPS1                       BANKMASK(SPI2SSPPS), 1, b
#define SPI2SSPPS2                       BANKMASK(SPI2SSPPS), 2, b
#define SPI2SSPPS3                       BANKMASK(SPI2SSPPS), 3, b
#define SPI2SSPPS4                       BANKMASK(SPI2SSPPS), 4, b
#define SPI2SSPPS5                       BANKMASK(SPI2SSPPS), 5, b
#define SPI2TCZIE                        BANKMASK(SPI2INTE), 6, b
#define SPI2TCZIF                        BANKMASK(SPI2INTF), 6, b
#define SPI2TXBE                         BANKMASK(SPI2STATUS), 5, b
#define SPI2TXIE                         BANKMASK(PIE11), 1, a
#define SPI2TXIF                         BANKMASK(PIR11), 1, a
#define SPI2TXIP                         BANKMASK(IPR11), 1, a
#define SPI2TXR                          BANKMASK(SPI2CON2), 1, b
#define SPI2TXUIE                        BANKMASK(SPI2INTE), 1, b
#define SPI2TXUIF                        BANKMASK(SPI2INTF), 1, b
#define SPI2TXWE                         BANKMASK(SPI2STATUS), 7, b
#define SPTR0                            BANKMASK(DMAnSPTRL), 0, b
#define SPTR1                            BANKMASK(DMAnSPTRL), 1, b
#define SPTR10                           BANKMASK(DMAnSPTRH), 2, b
#define SPTR11                           BANKMASK(DMAnSPTRH), 3, b
#define SPTR12                           BANKMASK(DMAnSPTRH), 4, b
#define SPTR13                           BANKMASK(DMAnSPTRH), 5, b
#define SPTR14                           BANKMASK(DMAnSPTRH), 6, b
#define SPTR15                           BANKMASK(DMAnSPTRH), 7, b
#define SPTR16                           BANKMASK(DMAnSPTRU), 0, b
#define SPTR17                           BANKMASK(DMAnSPTRU), 1, b
#define SPTR18                           BANKMASK(DMAnSPTRU), 2, b
#define SPTR19                           BANKMASK(DMAnSPTRU), 3, b
#define SPTR2                            BANKMASK(DMAnSPTRL), 2, b
#define SPTR20                           BANKMASK(DMAnSPTRU), 4, b
#define SPTR21                           BANKMASK(DMAnSPTRU), 5, b
#define SPTR3                            BANKMASK(DMAnSPTRL), 3, b
#define SPTR4                            BANKMASK(DMAnSPTRL), 4, b
#define SPTR5                            BANKMASK(DMAnSPTRL), 5, b
#define SPTR6                            BANKMASK(DMAnSPTRL), 6, b
#define SPTR7                            BANKMASK(DMAnSPTRL), 7, b
#define SPTR8                            BANKMASK(DMAnSPTRH), 0, b
#define SPTR9                            BANKMASK(DMAnSPTRH), 1, b
#define SSA0                             BANKMASK(DMAnSSAL), 0, b
#define SSA1                             BANKMASK(DMAnSSAL), 1, b
#define SSA10                            BANKMASK(DMAnSSAH), 2, b
#define SSA11                            BANKMASK(DMAnSSAH), 3, b
#define SSA12                            BANKMASK(DMAnSSAH), 4, b
#define SSA13                            BANKMASK(DMAnSSAH), 5, b
#define SSA14                            BANKMASK(DMAnSSAH), 6, b
#define SSA15                            BANKMASK(DMAnSSAH), 7, b
#define SSA16                            BANKMASK(DMAnSSAU), 0, b
#define SSA17                            BANKMASK(DMAnSSAU), 1, b
#define SSA18                            BANKMASK(DMAnSSAU), 2, b
#define SSA19                            BANKMASK(DMAnSSAU), 3, b
#define SSA2                             BANKMASK(DMAnSSAL), 2, b
#define SSA20                            BANKMASK(DMAnSSAU), 4, b
#define SSA21                            BANKMASK(DMAnSSAU), 5, b
#define SSA3                             BANKMASK(DMAnSSAL), 3, b
#define SSA4                             BANKMASK(DMAnSSAL), 4, b
#define SSA5                             BANKMASK(DMAnSSAL), 5, b
#define SSA6                             BANKMASK(DMAnSSAL), 6, b
#define SSA7                             BANKMASK(DMAnSSAL), 7, b
#define SSA8                             BANKMASK(DMAnSSAH), 0, b
#define SSA9                             BANKMASK(DMAnSSAH), 1, b
#define SSTP                             BANKMASK(DMAnCON1), 0, b
#define SSZ0                             BANKMASK(DMAnSSZL), 0, b
#define SSZ1                             BANKMASK(DMAnSSZL), 1, b
#define SSZ10                            BANKMASK(DMAnSSZH), 2, b
#define SSZ11                            BANKMASK(DMAnSSZH), 3, b
#define SSZ2                             BANKMASK(DMAnSSZL), 2, b
#define SSZ3                             BANKMASK(DMAnSSZL), 3, b
#define SSZ4                             BANKMASK(DMAnSSZL), 4, b
#define SSZ5                             BANKMASK(DMAnSSZL), 5, b
#define SSZ6                             BANKMASK(DMAnSSZL), 6, b
#define SSZ7                             BANKMASK(DMAnSSZL), 7, b
#define SSZ8                             BANKMASK(DMAnSSZH), 0, b
#define SSZ9                             BANKMASK(DMAnSSZH), 1, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKPTR5                          BANKMASK(STKPTR), 5, a
#define STKPTR6                          BANKMASK(STKPTR), 6, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define STRA                             BANKMASK(CWG1STR), 0, b
#define STRB                             BANKMASK(CWG1STR), 1, b
#define STRC                             BANKMASK(CWG1STR), 2, b
#define STRD                             BANKMASK(CWG1STR), 3, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, a
#define SWIF                             BANKMASK(PIR0), 0, a
#define SWIP                             BANKMASK(IPR0), 0, a
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, b
#define T0ASYNC                          BANKMASK(T0CON1), 4, b
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4, b
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, b
#define T0CKPS1                          BANKMASK(T0CON1), 1, b
#define T0CKPS2                          BANKMASK(T0CON1), 2, b
#define T0CKPS3                          BANKMASK(T0CON1), 3, b
#define T0CS0                            BANKMASK(T0CON1), 5, b
#define T0CS1                            BANKMASK(T0CON1), 6, b
#define T0CS2                            BANKMASK(T0CON1), 7, b
#define T0EN                             BANKMASK(T0CON0), 7, b
#define T0MD16                           BANKMASK(T0CON0), 4, b
#define T0OUT                            BANKMASK(T0CON0), 5, b
#define T0OUTPS0                         BANKMASK(T0CON0), 0, b
#define T0OUTPS1                         BANKMASK(T0CON0), 1, b
#define T0OUTPS2                         BANKMASK(T0CON0), 2, b
#define T0OUTPS3                         BANKMASK(T0CON0), 3, b
#define T0PR0                            BANKMASK(TMR0H), 0, b
#define T0PR1                            BANKMASK(TMR0H), 1, b
#define T0PR2                            BANKMASK(TMR0H), 2, b
#define T0PR3                            BANKMASK(TMR0H), 3, b
#define T0PR4                            BANKMASK(TMR0H), 4, b
#define T0PR5                            BANKMASK(TMR0H), 5, b
#define T0PR6                            BANKMASK(TMR0H), 6, b
#define T0PR7                            BANKMASK(TMR0H), 7, b
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5, b
#define T1CKPS0                          BANKMASK(T1CON), 4, b
#define T1CKPS1                          BANKMASK(T1CON), 5, b
#define T1CS0                            BANKMASK(T1CLK), 0, b
#define T1CS1                            BANKMASK(T1CLK), 1, b
#define T1CS2                            BANKMASK(T1CLK), 2, b
#define T1CS3                            BANKMASK(T1CLK), 3, b
#define T1CS4                            BANKMASK(T1CLK), 4, b
#define T1GE                             BANKMASK(T1GCON), 7, b
#define T1GGO                            BANKMASK(T1GCON), 3, b
#define T1GGO_NOT_DONE                   BANKMASK(T1GCON), 3, b
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3, b
#define T1GPOL                           BANKMASK(T1GCON), 6, b
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GPPS5                          BANKMASK(T1GPPS), 5, b
#define T1GSPM                           BANKMASK(T1GCON), 4, b
#define T1GSS0                           BANKMASK(T1GATE), 0, b
#define T1GSS1                           BANKMASK(T1GATE), 1, b
#define T1GSS2                           BANKMASK(T1GATE), 2, b
#define T1GSS3                           BANKMASK(T1GATE), 3, b
#define T1GSS4                           BANKMASK(T1GATE), 4, b
#define T1GTM                            BANKMASK(T1GCON), 5, b
#define T1GVAL                           BANKMASK(T1GCON), 2, b
#define T1RD16                           BANKMASK(T1CON), 1, b
#define T2CKPOL                          BANKMASK(T2HLT), 6, b
#define T2CKPS0                          BANKMASK(T2CON), 4, b
#define T2CKPS1                          BANKMASK(T2CON), 5, b
#define T2CKPS2                          BANKMASK(T2CON), 6, b
#define T2CKSYNC                         BANKMASK(T2HLT), 5, b
#define T2CS0                            BANKMASK(T2CLKCON), 0, b
#define T2CS1                            BANKMASK(T2CLKCON), 1, b
#define T2CS2                            BANKMASK(T2CLKCON), 2, b
#define T2CS3                            BANKMASK(T2CLKCON), 3, b
#define T2CS4                            BANKMASK(T2CLKCON), 4, b
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2INPPS5                         BANKMASK(T2INPPS), 5, b
#define T2MODE0                          BANKMASK(T2HLT), 0, b
#define T2MODE1                          BANKMASK(T2HLT), 1, b
#define T2MODE2                          BANKMASK(T2HLT), 2, b
#define T2MODE3                          BANKMASK(T2HLT), 3, b
#define T2MODE4                          BANKMASK(T2HLT), 4, b
#define T2ON                             BANKMASK(T2CON), 7, b
#define T2OUTPS0                         BANKMASK(T2CON), 0, b
#define T2OUTPS1                         BANKMASK(T2CON), 1, b
#define T2OUTPS2                         BANKMASK(T2CON), 2, b
#define T2OUTPS3                         BANKMASK(T2CON), 3, b
#define T2PSYNC                          BANKMASK(T2HLT), 7, b
#define T2RSEL0                          BANKMASK(T2RST), 0, b
#define T2RSEL1                          BANKMASK(T2RST), 1, b
#define T2RSEL2                          BANKMASK(T2RST), 2, b
#define T2RSEL3                          BANKMASK(T2RST), 3, b
#define T2RSEL4                          BANKMASK(T2RST), 4, b
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0, b
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1, b
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2, b
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3, b
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4, b
#define T3CKIPPS5                        BANKMASK(T3CKIPPS), 5, b
#define T3CKPS0                          BANKMASK(T3CON), 4, b
#define T3CKPS1                          BANKMASK(T3CON), 5, b
#define T3CS0                            BANKMASK(T3CLK), 0, b
#define T3CS1                            BANKMASK(T3CLK), 1, b
#define T3CS2                            BANKMASK(T3CLK), 2, b
#define T3CS3                            BANKMASK(T3CLK), 3, b
#define T3CS4                            BANKMASK(T3CLK), 4, b
#define T3GE                             BANKMASK(T3GCON), 7, b
#define T3GGO                            BANKMASK(T3GCON), 3, b
#define T3GGO_NOT_DONE                   BANKMASK(T3GCON), 3, b
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3, b
#define T3GPOL                           BANKMASK(T3GCON), 6, b
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GPPS5                          BANKMASK(T3GPPS), 5, b
#define T3GSPM                           BANKMASK(T3GCON), 4, b
#define T3GSS0                           BANKMASK(T3GATE), 0, b
#define T3GSS1                           BANKMASK(T3GATE), 1, b
#define T3GSS2                           BANKMASK(T3GATE), 2, b
#define T3GSS3                           BANKMASK(T3GATE), 3, b
#define T3GSS4                           BANKMASK(T3GATE), 4, b
#define T3GTM                            BANKMASK(T3GCON), 5, b
#define T3GVAL                           BANKMASK(T3GCON), 2, b
#define T3RD16                           BANKMASK(T3CON), 1, b
#define T4CKPOL                          BANKMASK(T4HLT), 6, b
#define T4CKPS0                          BANKMASK(T4CON), 4, b
#define T4CKPS1                          BANKMASK(T4CON), 5, b
#define T4CKPS2                          BANKMASK(T4CON), 6, b
#define T4CKSYNC                         BANKMASK(T4HLT), 5, b
#define T4CS0                            BANKMASK(T4CLKCON), 0, b
#define T4CS1                            BANKMASK(T4CLKCON), 1, b
#define T4CS2                            BANKMASK(T4CLKCON), 2, b
#define T4CS3                            BANKMASK(T4CLKCON), 3, b
#define T4CS4                            BANKMASK(T4CLKCON), 4, b
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4INPPS5                         BANKMASK(T4INPPS), 5, b
#define T4MODE0                          BANKMASK(T4HLT), 0, b
#define T4MODE1                          BANKMASK(T4HLT), 1, b
#define T4MODE2                          BANKMASK(T4HLT), 2, b
#define T4MODE3                          BANKMASK(T4HLT), 3, b
#define T4MODE4                          BANKMASK(T4HLT), 4, b
#define T4ON                             BANKMASK(T4CON), 7, b
#define T4OUTPS0                         BANKMASK(T4CON), 0, b
