garyPenhook/PIC-Assembler/device_includes/pic18f25q24.inc
#define T4OUTPS1                         BANKMASK(T4CON), 1, b
#define T4OUTPS2                         BANKMASK(T4CON), 2, b
#define T4OUTPS3                         BANKMASK(T4CON), 3, b
#define T4PSYNC                          BANKMASK(T4HLT), 7, b
#define T4RSEL0                          BANKMASK(T4RST), 0, b
#define T4RSEL1                          BANKMASK(T4RST), 1, b
#define T4RSEL2                          BANKMASK(T4RST), 2, b
#define T4RSEL3                          BANKMASK(T4RST), 3, b
#define T4RSEL4                          BANKMASK(T4RST), 4, b
#define T6CKPOL                          BANKMASK(T6HLT), 6, b
#define T6CKPS0                          BANKMASK(T6CON), 4, b
#define T6CKPS1                          BANKMASK(T6CON), 5, b
#define T6CKPS2                          BANKMASK(T6CON), 6, b
#define T6CKSYNC                         BANKMASK(T6HLT), 5, b
#define T6CS0                            BANKMASK(T6CLKCON), 0, b
#define T6CS1                            BANKMASK(T6CLKCON), 1, b
#define T6CS2                            BANKMASK(T6CLKCON), 2, b
#define T6CS3                            BANKMASK(T6CLKCON), 3, b
#define T6CS4                            BANKMASK(T6CLKCON), 4, b
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6INPPS5                         BANKMASK(T6INPPS), 5, b
#define T6MODE0                          BANKMASK(T6HLT), 0, b
#define T6MODE1                          BANKMASK(T6HLT), 1, b
#define T6MODE2                          BANKMASK(T6HLT), 2, b
#define T6MODE3                          BANKMASK(T6HLT), 3, b
#define T6MODE4                          BANKMASK(T6HLT), 4, b
#define T6ON                             BANKMASK(T6CON), 7, b
#define T6OUTPS0                         BANKMASK(T6CON), 0, b
#define T6OUTPS1                         BANKMASK(T6CON), 1, b
#define T6OUTPS2                         BANKMASK(T6CON), 2, b
#define T6OUTPS3                         BANKMASK(T6CON), 3, b
#define T6PSYNC                          BANKMASK(T6HLT), 7, b
#define T6RSEL0                          BANKMASK(T6RST), 0, b
#define T6RSEL1                          BANKMASK(T6RST), 1, b
#define T6RSEL2                          BANKMASK(T6RST), 2, b
#define T6RSEL3                          BANKMASK(T6RST), 3, b
#define T6RSEL4                          BANKMASK(T6RST), 4, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 7, a
#define TMR0IF                           BANKMASK(PIR3), 7, a
#define TMR0IP                           BANKMASK(IPR3), 7, a
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR10                            BANKMASK(TMR1L), 0, b
#define TMR11                            BANKMASK(TMR1L), 1, b
#define TMR110                           BANKMASK(TMR1H), 2, b
#define TMR111                           BANKMASK(TMR1H), 3, b
#define TMR112                           BANKMASK(TMR1H), 4, b
#define TMR113                           BANKMASK(TMR1H), 5, b
#define TMR114                           BANKMASK(TMR1H), 6, b
#define TMR115                           BANKMASK(TMR1H), 7, b
#define TMR12                            BANKMASK(TMR1L), 2, b
#define TMR13                            BANKMASK(TMR1L), 3, b
#define TMR14                            BANKMASK(TMR1L), 4, b
#define TMR15                            BANKMASK(TMR1L), 5, b
#define TMR16                            BANKMASK(TMR1L), 6, b
#define TMR17                            BANKMASK(TMR1L), 7, b
#define TMR18                            BANKMASK(TMR1H), 0, b
#define TMR19                            BANKMASK(TMR1H), 1, b
#define TMR1GIE                          BANKMASK(PIE3), 5, a
#define TMR1GIF                          BANKMASK(PIR3), 5, a
#define TMR1GIP                          BANKMASK(IPR3), 5, a
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 4, a
#define TMR1IF                           BANKMASK(PIR3), 4, a
#define TMR1IP                           BANKMASK(IPR3), 4, a
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2IE                           BANKMASK(PIE3), 3, a
#define TMR2IF                           BANKMASK(PIR3), 3, a
#define TMR2IP                           BANKMASK(IPR3), 3, a
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR30                            BANKMASK(TMR3L), 0, b
#define TMR31                            BANKMASK(TMR3L), 1, b
#define TMR310                           BANKMASK(TMR3H), 2, b
#define TMR311                           BANKMASK(TMR3H), 3, b
#define TMR312                           BANKMASK(TMR3H), 4, b
#define TMR313                           BANKMASK(TMR3H), 5, b
#define TMR314                           BANKMASK(TMR3H), 6, b
#define TMR315                           BANKMASK(TMR3H), 7, b
#define TMR32                            BANKMASK(TMR3L), 2, b
#define TMR33                            BANKMASK(TMR3L), 3, b
#define TMR34                            BANKMASK(TMR3L), 4, b
#define TMR35                            BANKMASK(TMR3L), 5, b
#define TMR36                            BANKMASK(TMR3L), 6, b
#define TMR37                            BANKMASK(TMR3L), 7, b
#define TMR38                            BANKMASK(TMR3H), 0, b
#define TMR39                            BANKMASK(TMR3H), 1, b
#define TMR3GIE                          BANKMASK(PIE4), 5, a
#define TMR3GIF                          BANKMASK(PIR4), 5, a
#define TMR3GIP                          BANKMASK(IPR4), 5, a
#define TMR3H0                           BANKMASK(TMR3H), 0, b
#define TMR3H1                           BANKMASK(TMR3H), 1, b
#define TMR3H2                           BANKMASK(TMR3H), 2, b
#define TMR3H3                           BANKMASK(TMR3H), 3, b
#define TMR3H4                           BANKMASK(TMR3H), 4, b
#define TMR3H5                           BANKMASK(TMR3H), 5, b
#define TMR3H6                           BANKMASK(TMR3H), 6, b
#define TMR3H7                           BANKMASK(TMR3H), 7, b
#define TMR3IE                           BANKMASK(PIE4), 4, a
#define TMR3IF                           BANKMASK(PIR4), 4, a
#define TMR3IP                           BANKMASK(IPR4), 4, a
#define TMR3L0                           BANKMASK(TMR3L), 0, b
#define TMR3L1                           BANKMASK(TMR3L), 1, b
#define TMR3L2                           BANKMASK(TMR3L), 2, b
#define TMR3L3                           BANKMASK(TMR3L), 3, b
#define TMR3L4                           BANKMASK(TMR3L), 4, b
#define TMR3L5                           BANKMASK(TMR3L), 5, b
#define TMR3L6                           BANKMASK(TMR3L), 6, b
#define TMR3L7                           BANKMASK(TMR3L), 7, b
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, b
#define TMR4IE                           BANKMASK(PIE10), 3, a
#define TMR4IF                           BANKMASK(PIR10), 3, a
#define TMR4IP                           BANKMASK(IPR10), 3, a
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMR6IE                           BANKMASK(PIE5), 3, a
#define TMR6IF                           BANKMASK(PIR5), 3, a
#define TMR6IP                           BANKMASK(IPR5), 3, a
#define TMR6MD                           BANKMASK(PMD1), 5, b
#define TMR6ON                           BANKMASK(T6CON), 7, b
#define TMRAOSEN                         BANKMASK(TU16ACON1), 6, b
#define TMRBOSEN                         BANKMASK(TU16BCON1), 6, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, b
#define TRISA1                           BANKMASK(TRISA), 1, b
#define TRISA2                           BANKMASK(TRISA), 2, b
#define TRISA3                           BANKMASK(TRISA), 3, b
#define TRISA4                           BANKMASK(TRISA), 4, b
#define TRISA5                           BANKMASK(TRISA), 5, b
#define TRISA6                           BANKMASK(TRISA), 6, b
#define TRISA7                           BANKMASK(TRISA), 7, b
#define TRISB0                           BANKMASK(TRISB), 0, b
#define TRISB1                           BANKMASK(TRISB), 1, b
#define TRISB2                           BANKMASK(TRISB), 2, b
#define TRISB3                           BANKMASK(TRISB), 3, b
#define TRISB4                           BANKMASK(TRISB), 4, b
#define TRISB5                           BANKMASK(TRISB), 5, b
#define TRISB6                           BANKMASK(TRISB), 6, b
#define TRISB7                           BANKMASK(TRISB), 7, b
#define TRISC0                           BANKMASK(TRISC), 0, b
#define TRISC1                           BANKMASK(TRISC), 1, b
#define TRISC2                           BANKMASK(TRISC), 2, b
#define TRISC3                           BANKMASK(TRISC), 3, b
#define TRISC4                           BANKMASK(TRISC), 4, b
#define TRISC5                           BANKMASK(TRISC), 5, b
#define TRISC6                           BANKMASK(TRISC), 6, b
#define TRISC7                           BANKMASK(TRISC), 7, b
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEL4                            BANKMASK(SCANTRIG), 4, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TU16ACAPT                        BANKMASK(TU16ACON1), 3, b
#define TU16ACIE                         BANKMASK(TU16ACON0), 0, b
#define TU16ACIF                         BANKMASK(TU16ACON1), 0, b
#define TU16ACLK0                        BANKMASK(TU16ACLK), 0, b
#define TU16ACLK1                        BANKMASK(TU16ACLK), 1, b
#define TU16ACLK2                        BANKMASK(TU16ACLK), 2, b
#define TU16ACLK3                        BANKMASK(TU16ACLK), 3, b
#define TU16ACLK4                        BANKMASK(TU16ACLK), 4, b
#define TU16ACLR                         BANKMASK(TU16ACON1), 5, b
#define TU16ACPOL                        BANKMASK(TU16ACON0), 6, b
#define TU16ACR0                         BANKMASK(TU16ACRL), 0, b
#define TU16ACR1                         BANKMASK(TU16ACRL), 1, b
#define TU16ACR10                        BANKMASK(TU16ACRH), 2, b
#define TU16ACR11                        BANKMASK(TU16ACRH), 3, b
#define TU16ACR12                        BANKMASK(TU16ACRH), 4, b
#define TU16ACR13                        BANKMASK(TU16ACRH), 5, b
#define TU16ACR14                        BANKMASK(TU16ACRH), 6, b
#define TU16ACR15                        BANKMASK(TU16ACRH), 7, b
#define TU16ACR2                         BANKMASK(TU16ACRL), 2, b
#define TU16ACR24                        BANKMASK(TU16ACRT), 0, b
#define TU16ACR25                        BANKMASK(TU16ACRT), 1, b
#define TU16ACR26                        BANKMASK(TU16ACRT), 2, b
#define TU16ACR27                        BANKMASK(TU16ACRT), 3, b
#define TU16ACR28                        BANKMASK(TU16ACRT), 4, b
#define TU16ACR29                        BANKMASK(TU16ACRT), 5, b
#define TU16ACR3                         BANKMASK(TU16ACRL), 3, b
#define TU16ACR30                        BANKMASK(TU16ACRT), 6, b
#define TU16ACR31                        BANKMASK(TU16ACRT), 7, b
#define TU16ACR4                         BANKMASK(TU16ACRL), 4, b
#define TU16ACR5                         BANKMASK(TU16ACRL), 5, b
#define TU16ACR6                         BANKMASK(TU16ACRL), 6, b
#define TU16ACR7                         BANKMASK(TU16ACRL), 7, b
#define TU16ACR8                         BANKMASK(TU16ACRH), 0, b
#define TU16ACR9                         BANKMASK(TU16ACRH), 1, b
#define TU16ACRH0                        BANKMASK(TU16ACRH), 0, b
#define TU16ACRH1                        BANKMASK(TU16ACRH), 1, b
#define TU16ACRH2                        BANKMASK(TU16ACRH), 2, b
#define TU16ACRH3                        BANKMASK(TU16ACRH), 3, b
#define TU16ACRH4                        BANKMASK(TU16ACRH), 4, b
#define TU16ACRH5                        BANKMASK(TU16ACRH), 5, b
#define TU16ACRH6                        BANKMASK(TU16ACRH), 6, b
#define TU16ACRH7                        BANKMASK(TU16ACRH), 7, b
#define TU16ACRL0                        BANKMASK(TU16ACRL), 0, b
#define TU16ACRL1                        BANKMASK(TU16ACRL), 1, b
#define TU16ACRL2                        BANKMASK(TU16ACRL), 2, b
#define TU16ACRL3                        BANKMASK(TU16ACRL), 3, b
#define TU16ACRL4                        BANKMASK(TU16ACRL), 4, b
#define TU16ACRL5                        BANKMASK(TU16ACRL), 5, b
#define TU16ACRL6                        BANKMASK(TU16ACRL), 6, b
#define TU16ACRL7                        BANKMASK(TU16ACRL), 7, b
#define TU16ACRT0                        BANKMASK(TU16ACRT), 0, b
#define TU16ACRT1                        BANKMASK(TU16ACRT), 1, b
#define TU16ACRT2                        BANKMASK(TU16ACRT), 2, b
#define TU16ACRT3                        BANKMASK(TU16ACRT), 3, b
#define TU16ACRT4                        BANKMASK(TU16ACRT), 4, b
#define TU16ACRT5                        BANKMASK(TU16ACRT), 5, b
#define TU16ACRT6                        BANKMASK(TU16ACRT), 6, b
#define TU16ACRT7                        BANKMASK(TU16ACRT), 7, b
#define TU16ACSYNC                       BANKMASK(TU16AHLT), 6, b
#define TU16AEPOL                        BANKMASK(TU16AHLT), 7, b
#define TU16AERS0                        BANKMASK(TU16AERS), 0, b
#define TU16AERS1                        BANKMASK(TU16AERS), 1, b
#define TU16AERS2                        BANKMASK(TU16AERS), 2, b
#define TU16AERS3                        BANKMASK(TU16AERS), 3, b
#define TU16AERS4                        BANKMASK(TU16AERS), 4, b
#define TU16AERS5                        BANKMASK(TU16AERS), 5, b
#define TU16AIE                          BANKMASK(PIE5), 2, a
#define TU16AIF                          BANKMASK(PIR5), 2, a
#define TU16AIP                          BANKMASK(IPR5), 2, a
#define TU16ALIMIT                       BANKMASK(TU16ACON1), 4, b
#define TU16AMD                          BANKMASK(PMD5), 1, b
#define TU16AOM                          BANKMASK(TU16ACON0), 5, b
#define TU16AON                          BANKMASK(TU16ACON0), 7, b
#define TU16AOPOL                        BANKMASK(TU16ACON0), 4, b
#define TU16APR0                         BANKMASK(TU16APRL), 0, b
#define TU16APR1                         BANKMASK(TU16APRL), 1, b
#define TU16APR10                        BANKMASK(TU16APRH), 2, b
#define TU16APR11                        BANKMASK(TU16APRH), 3, b
#define TU16APR12                        BANKMASK(TU16APRH), 4, b
#define TU16APR13                        BANKMASK(TU16APRH), 5, b
#define TU16APR14                        BANKMASK(TU16APRH), 6, b
#define TU16APR15                        BANKMASK(TU16APRH), 7, b
#define TU16APR2                         BANKMASK(TU16APRL), 2, b
#define TU16APR24                        BANKMASK(TU16APRT), 0, b
#define TU16APR25                        BANKMASK(TU16APRT), 1, b
#define TU16APR26                        BANKMASK(TU16APRT), 2, b
#define TU16APR27                        BANKMASK(TU16APRT), 3, b
#define TU16APR28                        BANKMASK(TU16APRT), 4, b
#define TU16APR29                        BANKMASK(TU16APRT), 5, b
#define TU16APR3                         BANKMASK(TU16APRL), 3, b
#define TU16APR30                        BANKMASK(TU16APRT), 6, b
#define TU16APR31                        BANKMASK(TU16APRT), 7, b
#define TU16APR4                         BANKMASK(TU16APRL), 4, b
#define TU16APR5                         BANKMASK(TU16APRL), 5, b
#define TU16APR6                         BANKMASK(TU16APRL), 6, b
#define TU16APR7                         BANKMASK(TU16APRL), 7, b
#define TU16APR8                         BANKMASK(TU16APRH), 0, b
#define TU16APR9                         BANKMASK(TU16APRH), 1, b
#define TU16APRH0                        BANKMASK(TU16APRH), 0, b
#define TU16APRH1                        BANKMASK(TU16APRH), 1, b
#define TU16APRH2                        BANKMASK(TU16APRH), 2, b
#define TU16APRH3                        BANKMASK(TU16APRH), 3, b
#define TU16APRH4                        BANKMASK(TU16APRH), 4, b
#define TU16APRH5                        BANKMASK(TU16APRH), 5, b
#define TU16APRH6                        BANKMASK(TU16APRH), 6, b
#define TU16APRH7                        BANKMASK(TU16APRH), 7, b
#define TU16APRIE                        BANKMASK(TU16ACON0), 2, b
#define TU16APRIF                        BANKMASK(TU16ACON1), 2, b
#define TU16APRL0                        BANKMASK(TU16APRL), 0, b
#define TU16APRL1                        BANKMASK(TU16APRL), 1, b
#define TU16APRL2                        BANKMASK(TU16APRL), 2, b
#define TU16APRL3                        BANKMASK(TU16APRL), 3, b
#define TU16APRL4                        BANKMASK(TU16APRL), 4, b
#define TU16APRL5                        BANKMASK(TU16APRL), 5, b
#define TU16APRL6                        BANKMASK(TU16APRL), 6, b
#define TU16APRL7                        BANKMASK(TU16APRL), 7, b
#define TU16APRT0                        BANKMASK(TU16APRT), 0, b
#define TU16APRT1                        BANKMASK(TU16APRT), 1, b
#define TU16APRT2                        BANKMASK(TU16APRT), 2, b
#define TU16APRT3                        BANKMASK(TU16APRT), 3, b
#define TU16APRT4                        BANKMASK(TU16APRT), 4, b
#define TU16APRT5                        BANKMASK(TU16APRT), 5, b
#define TU16APRT6                        BANKMASK(TU16APRT), 6, b
#define TU16APRT7                        BANKMASK(TU16APRT), 7, b
#define TU16APS0                         BANKMASK(TU16APS), 0, b
#define TU16APS1                         BANKMASK(TU16APS), 1, b
#define TU16APS2                         BANKMASK(TU16APS), 2, b
#define TU16APS3                         BANKMASK(TU16APS), 3, b
#define TU16APS4                         BANKMASK(TU16APS), 4, b
#define TU16APS5                         BANKMASK(TU16APS), 5, b
#define TU16APS6                         BANKMASK(TU16APS), 6, b
#define TU16APS7                         BANKMASK(TU16APS), 7, b
#define TU16ARDSEL                       BANKMASK(TU16ACON0), 3, b
#define TU16ARESET0                      BANKMASK(TU16AHLT), 2, b
#define TU16ARESET1                      BANKMASK(TU16AHLT), 3, b
#define TU16ARUN                         BANKMASK(TU16ACON1), 7, b
#define TU16ASTART0                      BANKMASK(TU16AHLT), 4, b
#define TU16ASTART1                      BANKMASK(TU16AHLT), 5, b
#define TU16ASTOP0                       BANKMASK(TU16AHLT), 0, b
#define TU16ASTOP1                       BANKMASK(TU16AHLT), 1, b
#define TU16ATMR0                        BANKMASK(TU16ATMRL), 0, b
#define TU16ATMR1                        BANKMASK(TU16ATMRL), 1, b
#define TU16ATMR10                       BANKMASK(TU16ATMRH), 2, b
#define TU16ATMR11                       BANKMASK(TU16ATMRH), 3, b
#define TU16ATMR12                       BANKMASK(TU16ATMRH), 4, b
#define TU16ATMR13                       BANKMASK(TU16ATMRH), 5, b
#define TU16ATMR14                       BANKMASK(TU16ATMRH), 6, b
#define TU16ATMR15                       BANKMASK(TU16ATMRH), 7, b
#define TU16ATMR2                        BANKMASK(TU16ATMRL), 2, b
#define TU16ATMR24                       BANKMASK(TU16ATMRT), 0, b
#define TU16ATMR25                       BANKMASK(TU16ATMRT), 1, b
#define TU16ATMR26                       BANKMASK(TU16ATMRT), 2, b
#define TU16ATMR27                       BANKMASK(TU16ATMRT), 3, b
#define TU16ATMR28                       BANKMASK(TU16ATMRT), 4, b
#define TU16ATMR29                       BANKMASK(TU16ATMRT), 5, b
#define TU16ATMR3                        BANKMASK(TU16ATMRL), 3, b
#define TU16ATMR30                       BANKMASK(TU16ATMRT), 6, b
#define TU16ATMR31                       BANKMASK(TU16ATMRT), 7, b
#define TU16ATMR4                        BANKMASK(TU16ATMRL), 4, b
#define TU16ATMR5                        BANKMASK(TU16ATMRL), 5, b
#define TU16ATMR6                        BANKMASK(TU16ATMRL), 6, b
#define TU16ATMR7                        BANKMASK(TU16ATMRL), 7, b
#define TU16ATMR8                        BANKMASK(TU16ATMRH), 0, b
#define TU16ATMR9                        BANKMASK(TU16ATMRH), 1, b
#define TU16ATMRH0                       BANKMASK(TU16ATMRH), 0, b
#define TU16ATMRH1                       BANKMASK(TU16ATMRH), 1, b
#define TU16ATMRH2                       BANKMASK(TU16ATMRH), 2, b
#define TU16ATMRH3                       BANKMASK(TU16ATMRH), 3, b
#define TU16ATMRH4                       BANKMASK(TU16ATMRH), 4, b
#define TU16ATMRH5                       BANKMASK(TU16ATMRH), 5, b
#define TU16ATMRH6                       BANKMASK(TU16ATMRH), 6, b
#define TU16ATMRH7                       BANKMASK(TU16ATMRH), 7, b
#define TU16ATMRL0                       BANKMASK(TU16ATMRL), 0, b
#define TU16ATMRL1                       BANKMASK(TU16ATMRL), 1, b
#define TU16ATMRL2                       BANKMASK(TU16ATMRL), 2, b
#define TU16ATMRL3                       BANKMASK(TU16ATMRL), 3, b
#define TU16ATMRL4                       BANKMASK(TU16ATMRL), 4, b
#define TU16ATMRL5                       BANKMASK(TU16ATMRL), 5, b
