garyPenhook/PIC-Assembler/device_includes/pic18f25q24.inc
#define UD                               BANKMASK(ACTCON), 6, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define VDDIO2LVDIE                      BANKMASK(PIE11), 3, a
#define VDDIO2LVDIF                      BANKMASK(PIR11), 3, a
#define VDDIO2LVDIP                      BANKMASK(IPR11), 3, a
#define VDDIO2nRDYIE                     BANKMASK(PIE11), 4, a
#define VDDIO2nRDYIF                     BANKMASK(PIR11), 4, a
#define VDDIO2nRDYIP                     BANKMASK(IPR11), 4, a
#define VREGPM0                          BANKMASK(VREGCON), 0, b
#define VREGPM1                          BANKMASK(VREGCON), 1, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WR2IE                            BANKMASK(I2C2PIE), 4, b
#define WR2IF                            BANKMASK(I2C2PIR), 4, b
#define WRERR                            BANKMASK(NVMCON1), 7, b
#define XIP                              BANKMASK(DMAnCON0), 0, b
#define XOR0                             BANKMASK(CRCXORL), 0, b
#define XOR1                             BANKMASK(CRCXORL), 1, b
#define XOR10                            BANKMASK(CRCXORH), 2, b
#define XOR11                            BANKMASK(CRCXORH), 3, b
#define XOR12                            BANKMASK(CRCXORH), 4, b
#define XOR13                            BANKMASK(CRCXORH), 5, b
#define XOR14                            BANKMASK(CRCXORH), 6, b
#define XOR15                            BANKMASK(CRCXORH), 7, b
#define XOR16                            BANKMASK(CRCXORU), 0, b
#define XOR17                            BANKMASK(CRCXORU), 1, b
#define XOR18                            BANKMASK(CRCXORU), 2, b
#define XOR19                            BANKMASK(CRCXORU), 3, b
#define XOR2                             BANKMASK(CRCXORL), 2, b
#define XOR20                            BANKMASK(CRCXORU), 4, b
#define XOR21                            BANKMASK(CRCXORU), 5, b
#define XOR22                            BANKMASK(CRCXORU), 6, b
#define XOR23                            BANKMASK(CRCXORU), 7, b
#define XOR24                            BANKMASK(CRCXORT), 0, b
#define XOR25                            BANKMASK(CRCXORT), 1, b
#define XOR26                            BANKMASK(CRCXORT), 2, b
#define XOR27                            BANKMASK(CRCXORT), 3, b
#define XOR28                            BANKMASK(CRCXORT), 4, b
#define XOR29                            BANKMASK(CRCXORT), 5, b
#define XOR3                             BANKMASK(CRCXORL), 3, b
#define XOR30                            BANKMASK(CRCXORT), 6, b
#define XOR31                            BANKMASK(CRCXORT), 7, b
#define XOR4                             BANKMASK(CRCXORL), 4, b
#define XOR5                             BANKMASK(CRCXORL), 5, b
#define XOR6                             BANKMASK(CRCXORL), 6, b
#define XOR7                             BANKMASK(CRCXORL), 7, b
#define XOR8                             BANKMASK(CRCXORH), 0, b
#define XOR9                             BANKMASK(CRCXORH), 1, b
#define ZCD1EN                           BANKMASK(ZCD1CON), 7, b
#define ZCD1IE                           BANKMASK(PIE2), 3, a
#define ZCD1IF                           BANKMASK(PIR2), 3, a
#define ZCD1INTN                         BANKMASK(ZCD1CON), 0, b
#define ZCD1INTP                         BANKMASK(ZCD1CON), 1, b
#define ZCD1IP                           BANKMASK(IPR2), 3, a
#define ZCD1MD                           BANKMASK(PMD1), 6, b
#define ZCD1OUT                          BANKMASK(ZCD1CON), 5, b
#define ZCD1POL                          BANKMASK(ZCD1CON), 4, b
#define ZCD2EN                           BANKMASK(ZCD2CON), 7, b
#define ZCD2IE                           BANKMASK(PIE2), 0, a
#define ZCD2IF                           BANKMASK(PIR2), 0, a
#define ZCD2INTN                         BANKMASK(ZCD2CON), 0, b
#define ZCD2INTP                         BANKMASK(ZCD2CON), 1, b
#define ZCD2IP                           BANKMASK(IPR2), 0, a
#define ZCD2MD                           BANKMASK(PMD5), 0, b
#define ZCD2OUT                          BANKMASK(ZCD2CON), 5, b
#define ZCD2POL                          BANKMASK(ZCD2CON), 4, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nDONE                            BANKMASK(NVMCON0), 0, b
#define nHYS                             BANKMASK(VDDIO2CON), 4, b
#define nIOMON                           BANKMASK(VDDIO2CON), 7, b
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRCM                             BANKMASK(PCON1), 0, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRVREG                           BANKMASK(PCON1), 2, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nT1SYNC                          BANKMASK(T1CON), 2, b
#define nT3SYNC                          BANKMASK(T3CON), 2, b
#define nWDTWV                           BANKMASK(PCON0), 5, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F25Q24_INC_
